test/cassettes/new_stripe_customer.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=7&card[exp_year]=2017&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_BFrpXwChkcFOCCdJSsppJiwk
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-darwin13","engine":"ruby","publisher":"stripe","uname":"Darwin
        maryanne.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"maryanne.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 04 Jul 2015 22:14:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '780'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6Y53E60vvqpVJa
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16KytZEq8J2bfnqA6Gtgdk9p",
          "livemode": false,
          "created": 1436048041,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16KytZEq8J2bfnqAvMhIouA5",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 7,
            "exp_year": 2017,
            "fingerprint": "duspC3ZpcqHaLZSH",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "73.158.58.134"
        }
    http_version: 
  recorded_at: Sat, 04 Jul 2015 22:14:01 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: source=tok_16KytZEq8J2bfnqA6Gtgdk9p&email=alice1%40example.com
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.22.0
      Authorization:
      - Bearer sk_test_BFrpXwChkcFOCCdJSsppJiwk
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.22.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-darwin13","engine":"ruby","publisher":"stripe","uname":"Darwin
        maryanne.local 14.3.0 Darwin Kernel Version 14.3.0: Mon Mar 23 11:59:05 PDT
        2015; root:xnu-2782.20.48~5/RELEASE_X86_64 x86_64 i386 MacBookPro12,1 Darwin","hostname":"maryanne.local"}'
      Content-Length:
      - '62'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 04 Jul 2015 22:14:07 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1375'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_6Y53BUvnw7ENnj
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1436048046,
          "id": "cus_6Y53pOOnofhfZa",
          "livemode": false,
          "description": null,
          "email": "alice1@example.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6Y53pOOnofhfZa/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "sources": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_6Y53pOOnofhfZa/sources",
            "data": [
              {
                "id": "card_16KytZEq8J2bfnqAvMhIouA5",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 7,
                "exp_year": 2017,
                "fingerprint": "duspC3ZpcqHaLZSH",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "tokenization_method": null,
                "dynamic_last4": null,
                "metadata": {},
                "customer": "cus_6Y53pOOnofhfZa"
              }
            ]
          },
          "default_source": "card_16KytZEq8J2bfnqAvMhIouA5"
        }
    http_version: 
  recorded_at: Sat, 04 Jul 2015 22:14:06 GMT
recorded_with: VCR 2.9.3
